---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsRamp
source: html/12bd2644-f7d9-388d-fdd0-e743a399a089.htm
---
# Autodesk.Revit.DB.IFC.IFCLegacyStairOrRamp.IsRamp Property

True if it is a ramp, false if it is a stair.

## Syntax (C#)
```csharp
public bool IsRamp { get; }
```